W6D4/my_reddit/app/views/shared/_comment.html.erb

<ul>
  <% comment.child_comments.each do |child| %>
---
SELECT "comments".* FROM "comments" WHERE (post_id = 7 AND parent_comment_id IS NULL)