W6D4/my_reddit/app/views/posts/show.html.erb

<ul>
  <% Comment.where("post_id = ? AND parent_comment_id IS NULL", @post.id).each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."parent_comment_id" IS NULL  [["post_id", 8]]