W6D4/my_reddit/app/controllers/application_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def ensure_sub_ownership
    @sub = Sub.find_by(id: params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def ensure_post_ownership
    @post = Post.find_by(id: params[:id])