W6D4/my_reddit/app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "author_id", "post_id", "parent_comment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "hello"], ["author_id", 1], ["post_id", 7], ["parent_comment_id", 1], ["created_at", "2019-10-10 23:03:41.314042"], ["updated_at", "2019-10-10 23:03:41.314042"]]
---
  def create
    @comment = current_user.comments.new(comment_params)
    @comment.post_id = params[:post_id]
    @comment.parent_comment_id = params[:comment][:parent_comment_id] if params[:comment][:parent_comment_id]

    flash[:errors] = @comment.errors.full_messages unless @comment.save