W6D4/my_reddit/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "First post"], ["url", ""], ["content", "YAY"], ["sub_id", 2], ["author_id", 2], ["created_at", "2019-10-10 20:24:56.366168"], ["updated_at", "2019-10-10 20:24:56.366168"]]
---
  def create
    @post = Post.new(post_params)
    @post.sub_id = params[:sub_id]
    @post.author_id = current_user.id

    if @post.save

UPDATE "posts" SET "title" = $1, "url" = $2, "content" = $3, "updated_at" = $4 WHERE "posts"."id" = $5  [["title", "Reddit Lite"], ["url", "lsdfsa"], ["content", "hahaha"], ["updated_at", "2019-10-10 20:38:22.411391"], ["id", 5]]
---
  def update
    if @post.update(post_params)