W6D4/my_reddit/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "moderator_id", "created_at", "updated_at", "description") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @sub = current_user.subs.new(sub_params)

    if @sub.save

UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "Coding is cool!!!"], ["updated_at", "2019-10-10 19:39:55.901950"], ["id", 2]]
---
  def update
    # @sub = current_user.subs.find(params[:id])

    if @sub.update(sub_params)