W6D4/my_reddit/app/views/subs/show.html.erb

<ul>
  <% @sub.posts.order(created_at: :desc).each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."sub_id" = $1 ORDER BY "posts"."created_at" DESC  [["sub_id", 1]]