W6D4/my_reddit/app/views/comments/_comment.html.erb

<ul>
  <% comment.child_comments.each do |child| %>
---
SELECT "comments".* FROM "comments" WHERE (post_id = 8 AND parent_comment_id IS NULL)